frain1219/ZHIYUN_F100/SDK/APM32F10x_SDK_V2.0.0/Utilities/SVD/APM32F103xC.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="GPIOA">
            <name>GPIOB</name>
            <baseAddress>0x40010C00</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOA">
            <name>GPIOC</name>
            <baseAddress>0x40011000</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOA">
            <name>GPIOD</name>
            <baseAddress>0x40011400</baseAddress>
        </peripheral>
        <peripheral derivedFrom="GPIOA">
            <name>GPIOE</name>
            <baseAddress>0x40011800</baseAddress>
        </peripheral>


        <peripheral>
            <name>EINT</name>
            <description>External Interrupt</description>
            <groupName>EINT</groupName>
            <baseAddress>0x40010400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TAMPER</name>
                <description>Tamper interrupt</description>
                <value>2</value>
            </interrupt>
            <interrupt>
                <name>EINT0</name>
                <description>EINT Line0 interrupt</description>
                <value>6</value>
            </interrupt>
            <interrupt>
                <name>EINT1</name>
                <description>EINT Line1 interrupt</description>
                <value>7</value>
            </interrupt>
            <interrupt>
                <name>EINT2</name>
                <description>EINT Line2 interrupt</description>
                <value>8</value>
            </interrupt>
            <interrupt>
                <name>EINT3</name>
                <description>EINT Line3 interrupt</description>
                <value>9</value>
            </interrupt>
            <interrupt>
                <name>EINT4</name>
                <description>EINT Line4 interrupt</description>
                <value>10</value>
            </interrupt>
            <interrupt>
                <name>EINT9_5</name>
                <description>EINT Line[9:5] interrupts</description>
                <value>23</value>
            </interrupt>
            <interrupt>
                <name>EINT15_10</name>
                <description>EINT Line[15:10] interrupts</description>
                <value>40</value>
            </interrupt>
            <registers>
                <register>
                    <name>IMASK</name>
                    <displayName>IMASK</displayName>
                    <description>Interrupt mask register (EINT_IMASK)</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IMASK0</name>
                            <description>Interrupt Mask on line 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK1</name>
                            <description>Interrupt Mask on line 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK2</name>
                            <description>Interrupt Mask on line 2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK3</name>
                            <description>Interrupt Mask on line 3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK4</name>
                            <description>Interrupt Mask on line 4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK5</name>
                            <description>Interrupt Mask on line 5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK6</name>
                            <description>Interrupt Mask on line 6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK7</name>
                            <description>Interrupt Mask on line 7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK8</name>
                            <description>Interrupt Mask on line 8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK9</name>
                            <description>Interrupt Mask on line 9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK10</name>
                            <description>Interrupt Mask on line 10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK11</name>
                            <description>Interrupt Mask on line 11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK12</name>
                            <description>Interrupt Mask on line 12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK13</name>
                            <description>Interrupt Mask on line 13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK14</name>
                            <description>Interrupt Mask on line 14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK15</name>
                            <description>Interrupt Mask on line 15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK16</name>
                            <description>Interrupt Mask on line 16</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK17</name>
                            <description>Interrupt Mask on line 17</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IMASK18</name>
                            <description>Interrupt Mask on line 18</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>

                    </fields>
                </register>
                <register>
                    <name>EMASK</name>
                    <displayName>EMASK</displayName>
                    <description>Event mask register (EINT_EMASK)</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EMASK0</name>
                            <description>Event Mask on line 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK1</name>
                            <description>Event Mask on line 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK2</name>
                            <description>Event Mask on line 2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK3</name>
                            <description>Event Mask on line 3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK4</name>
                            <description>Event Mask on line 4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK5</name>
                            <description>Event Mask on line 5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK6</name>
                            <description>Event Mask on line 6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK7</name>
                            <description>Event Mask on line 7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK8</name>
                            <description>Event Mask on line 8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK9</name>
                            <description>Event Mask on line 9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK10</name>
                            <description>Event Mask on line 10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK11</name>
                            <description>Event Mask on line 11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK12</name>
                            <description>Event Mask on line 12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK13</name>
                            <description>Event Mask on line 13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK14</name>
                            <description>Event Mask on line 14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK15</name>
                            <description>Event Mask on line 15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK16</name>
                            <description>Event Mask on line 16</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK17</name>
                            <description>Event Mask on line 17</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMASK18</name>
                            <description>Event Mask on line 18</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTEN</name>
                    <displayName>RTEN</displayName>
                    <description>Rising Trigger selection register (EINT_RTEN)</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTEN0</name>
                            <description>Rising trigger event configuration of line 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN1</name>
                            <description>Rising trigger event configuration of line 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN2</name>
                            <description>Rising trigger event configuration of line 2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN3</name>
                            <description>Rising trigger event configuration of line 3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN4</name>
                            <description>Rising trigger event configuration of line 4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN5</name>
                            <description>Rising trigger event configuration of line 5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN6</name>
                            <description>Rising trigger event configuration of line 6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN7</name>
                            <description>Rising trigger event configuration of line 7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN8</name>
                            <description>Rising trigger event configuration of line 8</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN9</name>
                            <description>Rising trigger event configuration of line 9</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN10</name>
                            <description>Rising trigger event configuration of line 10</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN11</name>
                            <description>Rising trigger event configuration of line 11</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN12</name>
                            <description>Rising trigger event configuration of line 12</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN13</name>
                            <description>Rising trigger event configuration of line 13</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN14</name>
                            <description>Rising trigger event configuration of line 14</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN15</name>
                            <description>Rising trigger event configuration of line 15</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN16</name>
                            <description>Rising trigger event configuration of line 16</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN17</name>
                            <description>Rising trigger event configuration of line 17</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTEN18</name>
                            <description>Rising trigger event configuration of line 18</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
