frain1219/ZHIYUN_F100/SDK/APM32F10x_SDK_V2.0.0/Utilities/SVD/APM32F103xC.svd
            </registers>
        </peripheral>

        <peripheral>
            <name>USBD</name>
            <description>Universal serial bus full-speed device interface</description>
            <groupName>USBD</groupName>
            <baseAddress>0x40005C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>USBDWakeUp</name>
                <description>USB Device FS Wakeup through EINT line interrupt</description>
                <value>42</value>
            </interrupt>
            <registers>
                <register>
                    <name>EP0</name>
                    <displayName>EP0</displayName>
                    <description>endpoint 0 register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Endpoint address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>TXSTS</name>
                            <description>Status bits, for transmission transfers</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TXDTOG</name>
                            <description>Data Toggle, for transmission transfers</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTFT</name>
                            <description>Correct Transfer for transmission</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>KIND</name>
                            <description>Endpoint kind</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SETUP</name>
                            <description>Setup transaction completed</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTS</name>
                            <description>Status bits, for reception transfers</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RXDTOG</name>
                            <description>Data Toggle, for reception transfers</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTFR</name>
                            <description>Correct transfer for reception</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EP1</name>
                    <displayName>EP1</displayName>
                    <description>endpoint 1 register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Endpoint address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>TXSTS</name>
                            <description>Status bits, for transmission transfers</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TXDTOG</name>
                            <description>Data Toggle, for transmission transfers</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTFT</name>
                            <description>Correct Transfer for transmission</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>KIND</name>
                            <description>Endpoint kind</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SETUP</name>
                            <description>Setup transaction completed</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTS</name>
                            <description>Status bits, for reception transfers</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RXDTOG</name>
                            <description>Data Toggle, for reception transfers</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTFR</name>
                            <description>Correct transfer for reception</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>

                </register>
                <register>
                    <name>EP2</name>
                    <displayName>EP2</displayName>
                    <description>endpoint 2 register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Endpoint address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>TXSTS</name>
                            <description>Status bits, for transmission transfers</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TXDTOG</name>
                            <description>Data Toggle, for transmission transfers</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTFT</name>
                            <description>Correct Transfer for transmission</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>KIND</name>
                            <description>Endpoint kind</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SETUP</name>
                            <description>Setup transaction completed</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTS</name>
                            <description>Status bits, for reception transfers</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RXDTOG</name>
                            <description>Data Toggle, for reception transfers</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTFR</name>
                            <description>Correct transfer for reception</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>

                </register>
                <register>
                    <name>EP3</name>
                    <displayName>EP3</displayName>
                    <description>endpoint 3 register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Endpoint address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>TXSTS</name>
                            <description>Status bits, for transmission transfers</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TXDTOG</name>
                            <description>Data Toggle, for transmission transfers</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTFT</name>
                            <description>Correct Transfer for transmission</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>KIND</name>
                            <description>Endpoint kind</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SETUP</name>
                            <description>Setup transaction completed</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTS</name>
                            <description>Status bits, for reception transfers</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RXDTOG</name>
                            <description>Data Toggle, for reception transfers</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTFR</name>
                            <description>Correct transfer for reception</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EP4</name>
                    <displayName>EP4</displayName>
                    <description>endpoint 4 register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Endpoint address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>TXSTS</name>
                            <description>Status bits, for transmission transfers</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TXDTOG</name>
                            <description>Data Toggle, for transmission transfers</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTFT</name>
                            <description>Correct Transfer for transmission</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>KIND</name>
                            <description>Endpoint kind</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SETUP</name>
                            <description>Setup transaction completed</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTS</name>
                            <description>Status bits, for reception transfers</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RXDTOG</name>
                            <description>Data Toggle, for reception transfers</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTFR</name>
                            <description>Correct transfer for reception</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EP5</name>
                    <displayName>EP5</displayName>
                    <description>endpoint 5 register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Endpoint address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>TXSTS</name>
                            <description>Status bits, for transmission transfers</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TXDTOG</name>
                            <description>Data Toggle, for transmission transfers</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTFT</name>
                            <description>Correct Transfer for transmission</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>KIND</name>
                            <description>Endpoint kind</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SETUP</name>
                            <description>Setup transaction completed</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXSTS</name>
                            <description>Status bits, for reception transfers</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>RXDTOG</name>
                            <description>Data Toggle, for reception transfers</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTFR</name>
                            <description>Correct transfer for reception</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
